#include "hc_sr04.h"

/*******************************************************************************
* º¯ Êı Ãû			 : StartModule
* Êä    Èë			 : ÎŞ
* Êä    ³ö			 : ÎŞ
* º¯Êı¹¦ÄÜ			 : Æô¶¯Hc_sr04³¬Éù²¨Ä£¿é
* ÏêÏ¸ÃèÊö			 : Æô¶¯Hc_sr04³¬Éù²¨Ä£¿é,Ä£¿éµÄTrig(¿ØÖÆ¶Ë)¶Ë¿ÚÀ­¸ß10usÒÔÉÏ£
							Ä£¿é¾Í»á×Ô¶¯·¢³ö8¸ö40khzµÄ·½²¨¡£
*******************************************************************************/
void  StartModule(void)					//Æô¶¯Ä£¿é
{
	TX = 1;									//Æô¶¯Ò»´ÎÄ£¿é
	Delay_X10us(2);						//10usÒÔÉÏ¸ßµçÆ½
	TX = 0;
}

/*******************************************************************************
* º¯ Êı Ãû			 : Hc_sr04GetDistance
* Êä    Èë			 : ÎŞ
* Êä    ³ö			 : ¾àÀë£¨µ¥Î»cm£©
* º¯Êı¹¦ÄÜ			 : ²âÁ¿Ò»´Î¾àÀë
* ÏêÏ¸ÃèÊö			 : Æô¶¯Hc_sr04³¬Éù²¨Ä£¿é,Ä£¿éµÄTrig(¿ØÖÆ¶Ë)¶Ë¿ÚÀ­¸ß10usÒÔÉÏ£¬¾Í
							¿ÉÒÔÔÚEcho(½ÓÊÕ¶Ë)µÈ´ı¸ßµçÆ½±äÎªµÍµçÆ½£¬²¢¼ÆËãÕâ¶ÎÊ±¼ä£¬½ø¶ø
							¼ÆËã³ö¾àÀë£¬Ê¹ÓÃ´Ëº¯ÊıĞèÒª¿ªÆô¼ÆÊıÆ÷0²¢ÉèÖÃ×î´ó¼ÆÊıÊ±¼ä¡£
*******************************************************************************/
float Hc_sr04GetDistance(void)
{
	uint Time;
	float Distance;
	
	TH0 = 0;
	TL0 = 0;
	StartModule();
	
	while(!RX);								//µ±RXÎªÁãÊ±µÈ´ı
	TR0 = 1;									//¿ªÆô¼ÆÊı
	
	while(RX && TF0 == 0);				//µ±RXÎª1¼ÆÊı²¢µÈ´ı
	TR0 = 0;									//¹Ø±Õ¼ÆÊı
	
	if(TF0 == 1)							//³¬³öÁ¿³ÌÏÔÊ¾999
	{
		TF0 = 0;
		Distance = 999;
	}
	else
	{
		Time = TH0 * 256 + TL0;
		Distance = (Time * 17) / 1000;//Ëã³öÀ´ÊÇCM
	}
	
	return Distance;
}

/*******************************************************************************
* º¯ Êı Ãû			 : Test_Separate_Buttons_UART
* Êä    Èë			 : ¿Õ
* Êä    ³ö			 :	¿Õ
* º¯Êı¹¦ÄÜ			 : ³¬Éù²¨²âÊÔ³ÌĞò
* ÏêÏ¸ÃèÊö			 :	´®¿ÚÏÔÊ¾³¬Éù²¨²âÁ¿µÄ¾àÀë£¬½öÏÔÊ¾3Î»Êı£¬Ê¹ÓÃ´Ëº¯ÊıĞèÒª¿ªÆô¼Æ
							ÊıÆ÷0ºÍ´®¿Ú
*******************************************************************************/
void Test_Hc_sr04GetDistance_UART(void)
{
	unsigned int Distance;
	
	#if Uart
	unsigned char Buf[] = {"Distance = xxx \r\n"};
	#endif
	
	while(1)
	{
		Distance = Hc_sr04GetDistance();
		
		#if Uart
		sprintf(&Buf[11],"%3d",((int)Distance)%1000);
		UART1_Send_Data(&Buf,17);
		#endif
		
		Delay_Xms(100);
	}
}