#include "test_led.h"

#include "REG52.h"
#include "delay.h"



/*******************************************************************************
* 函 数 名         : Test_Led
* 输    入         : 空
* 输    出         :	空
* 函数功能		    : LED核心板IO测试实现程序
* 详细描述			 :	当前程序是IO翻转程序，对应LED测试板所有的灯会闪烁
*******************************************************************************/
void Test_Led(void)
{
	while(1)
	{
	P0=0xFF;
	P1=0xFF;
	P2=0xFF;
	P3=0xFF;
	Delay_Xms(500);
	P0=0x00;
	P1=0x00;
	P2=0x00;
	P3=0x00;
	Delay_Xms(500);
	}
}